{"config": {"layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "scale": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "scale": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "scale": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "units": 256, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2", "units": 128, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_3", "units": 64, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_4", "units": 2, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}